### Problem: what are observations?
- observations compress -> models architecture

In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# dice

outcomes = [1,2,3,4,5,6]
results = np.random.choice(outcomes, size = 100)
df = pd.DataFrame(results, columns = ['Dice Outcome'])
df.head()

   Dice Outcome
0             4
1             3
2             4
3             1
4             5

In [4]:
# covert the "dice outcome' column to a one-hot encoding
df_dummies = pd.get_dummies(df, columns = ['Dice Outcome'], prefix= 'outcome')
df_dummies

    outcome_1  outcome_2  outcome_3  outcome_4  outcome_5  outcome_6
0       False      False      False       True      False      False
1       False      False       True      False      False      False
2       False      False      False       True      False      False
3        True      False      False      False      False      False
4       False      False      False      False       True      False
..        ...        ...        ...        ...        ...        ...
95      False      False      False      False      False       True
96      False      False      False      False       True      False
97      False      False      False       True      False      False
98      False       True      False      False      False      False
99      False       True      False      False      False      False

[100 rows x 6 columns]

### Again what are observations?

- how to precisely define observations/data/sample
- first, define the space behind the variable
- then, an obersation/sample is always an occurrence in the space
- we collect data we need understand the variable and space

throw dice 100 times, counting how many times 1 turns up. record 18 (0-100)
throw dice 100 times, counting how many times 1 turns up. record 20
throw dice 100 times, counting how many times 1 turns up. record 9
throw dice 100 times, counting how many times 1 turns up. record 30
variable is how many times '1' turns up, the sapce is (0-100)

### 2 kinds of variables 
- discrete/categorical variables
- continuous variable

### continuous variable

In [5]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from sklearn.cluster import KMeans
from sklearn.preprocessing import StandardScaler

# Generate synthetic data for Cluster 1 (Shorter, Higher Income)
heights_c1 = np.random.uniform(150, 170, 50)  # Shorter individuals
incomes_c1 = np.random.uniform(100000, 150000, 50)   # Higher income

# Generate synthetic data for Cluster 2 (Taller, Lower Income)
heights_c2 = np.random.uniform(170, 180, 50)  # Taller individuals
incomes_c2 = np.random.uniform(50000, 90000, 50)    # Lower income

# Combine into a single dataset
heights = np.concatenate([heights_c1, heights_c2])
incomes = np.concatenate([incomes_c1, incomes_c2])
df = pd.DataFrame({'Height': heights, 'Income': incomes})
df

        Height         Income
0   166.023538  109684.401033
1   165.967518  129177.771848
2   162.083285  149697.301705
3   150.261490  105433.379845
4   166.711998  131236.776095
..         ...            ...
95  170.220684   54027.372076
96  174.648645   84545.749464
97  172.333778   81198.639595
98  178.494113   89449.592601
99  178.295120   78271.047757

[100 rows x 2 columns]

In [6]:
scaler = StandardScaler()
df_scaled = scaler.fit_transform(df)
df_scaled = pd.DataFrame(df_scaled, columns = ['Height scaled','Income scaled'])

df_scaled

    Height scaled  Income scaled
0       -0.125166       0.337110
1       -0.131511       1.004175
2       -0.571402       1.706355
3       -1.910225       0.191639
4       -0.047198       1.074634
..            ...            ...
95       0.350162      -1.567479
96       0.851631      -0.523137
97       0.589471      -0.637676
98       1.287132      -0.355327
99       1.264596      -0.737858

[100 rows x 2 columns]

### recap
- observations -> 2kinds
- transform the data to a digestable forms for ML, but at same time, we don't want to lose info
- transform the obs, for discrete obs we need do one-hot encoding, for continuous we need to standard scaler.

### Activity 2, transform observations

In [10]:
import pandas as pd
import hvplot.pandas
from pathlib import Path
from sklearn.cluster import KMeans
from sklearn.preprocessing import StandardScaler

df_shopping = pd.read_csv(
    Path("Resources/shopping_data.csv")
)

df_shopping.head()

   CustomerID Card Type  Age  Annual Income  Spending Score
0           1    Credit   19          15000              39
1           2    Credit   21          15000              81
2           3     Debit   20          16000               6
3           4     Debit   23          16000              77
4           5     Debit   31          17000              40

In [14]:
from sklearn.preprocessing import StandardScaler
shopping_data_scaled = StandardScaler().fit_transform(df_shopping[["Age","Annual Income","Spending Score"]])
shopping_data_scaled.shape

df_shopping_transformed = pd.DataFrame(shopping_data_scaled, columns=["Age","Annual Income","Spending Score"])
df_shopping_transformed

          Age  Annual Income  Spending Score
0   -1.424569      -1.738999       -0.434801
1   -1.281035      -1.738999        1.195704
2   -1.352802      -1.700830       -1.715913
3   -1.137502      -1.700830        1.040418
4   -0.563369      -1.662660       -0.395980
..        ...            ...             ...
195 -0.276302       2.268791        1.118061
196  0.441365       2.497807       -0.861839
197 -0.491602       2.497807        0.923953
198 -0.491602       2.917671       -1.250054
199 -0.635135       2.917671        1.273347

[200 rows x 3 columns]

In [15]:
card_dummies = pd.get_dummies(df_shopping['Card Type'])
card_dummies

     Credit  Debit
0      True  False
1      True  False
2     False   True
3     False   True
4     False   True
..      ...    ...
195   False   True
196   False   True
197    True  False
198    True  False
199    True  False

[200 rows x 2 columns]

In [16]:
df_shopping_transformed = pd.concat([df_shopping_transformed,card_dummies],axis = 1)
df_shopping_transformed

          Age  Annual Income  Spending Score  Credit  Debit
0   -1.424569      -1.738999       -0.434801    True  False
1   -1.281035      -1.738999        1.195704    True  False
2   -1.352802      -1.700830       -1.715913   False   True
3   -1.137502      -1.700830        1.040418   False   True
4   -0.563369      -1.662660       -0.395980   False   True
..        ...            ...             ...     ...    ...
195 -0.276302       2.268791        1.118061   False   True
196  0.441365       2.497807       -0.861839   False   True
197 -0.491602       2.497807        0.923953    True  False
198 -0.491602       2.917671       -1.250054    True  False
199 -0.635135       2.917671        1.273347    True  False

[200 rows x 5 columns]

### if the categorical variable is binary, all you need to do is to use one col encode 0,1

### some insights
- obs space, the cost of adding a categorical variable is not only the vriable, but all dimentions.
- investing.

### Activity 3

### activity 5